 -- QUESTION: Show me all components of Contract x

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name="00000199609C0398F1963093D0001") MATCH p=(n)-[:is_a]->(l),q=(n)-[]->(x) RETURN p,q;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                      | q                                                                                                                                            |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasDeliverables[18495826] {},Node[14649082]{name:"CUSTOM_COMPUTER_PROGRAMMING_SERVICES"}] |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasObligationValue[58501037] {},Node[10942195]{name:"71000"}]                             |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061189] {},Node[4648182]{name:"1996-09-15_2001-10-15"}]                        |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061147] {},Node[38401927]{name:"VIRGINIA_"}]                                   |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061113] {},Node[30991014]{name:"PRC_INC."}]                                    |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061045] {},Node[14649082]{name:"CUSTOM_COMPUTER_PROGRAMMING_SERVICES"}]        |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}]                                       |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isAwardedTo[321097054] {},Node[30991014]{name:"PRC_INC."}]                                |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isExecutedDuring[518851606] {},Node[4648182]{name:"1996-09-15_2001-10-15"}]               |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isExecutedIn[552804697] {},Node[38401927]{name:"VIRGINIA_"}]                              |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isGivenTo[622657329] {},Node[30991014]{name:"PRC_INC."}]                                  |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isManagedBy[652906076] {},Node[15533062]{name:"DEFENSE_LOGISTICS_AGENCY"}]                |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isPerformedDuring[733897218] {},Node[4648182]{name:"1996-09-15_2001-10-15"}]              |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isPerformedIn[767850308] {},Node[38401927]{name:"VIRGINIA_"}]                             |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasActionValue[1148189637] {},Node[10942195]{name:"71000"}]                               |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasContractValue[1185953118] {},Node[18]{name:"0"}]                                       |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
16 rows
1549 ms
 
 -- QUESTION: Show me all contracts managed by org x and funded by org x

 -- QUERY: neo4j-sh (0)$ START m=node:contractsNodesIndex(name = 'Contract'),l=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE'),svm=node:contractsNodesIndex(name = 'DLA_LAND_AND_MARITIME')  MATCH (n)-[:is_a]-(m),(n)-[:isManagedBy]->(l),(n)-[:isFundedBy]->(svm) RETURN n LIMIT 5;
+-----------------------------+
| n                           |
+-----------------------------+
| Node[39943600]{name:"ZZL6"} |
| Node[39943599]{name:"ZZG8"} |
| Node[39943597]{name:"ZZDA"} |
| Node[39943595]{name:"ZZB6"} |
| Node[39943594]{name:"ZZB5"} |
+-----------------------------+
5 rows
7 ms
 
 -- QUESTION: Show me all the services that org x delivers
 
 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name = 'Organization'),x=node:contractsNodesIndex(name = 'WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS') MATCH p=(x)-[:is_a]-(n),m=(x)-[:delivers]->(l) RETURN p,m;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                 | m                                                                                                                                                                                        |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176712] {},Node[31323288]{name:"RESEARCH_AND_DEVELOPMENT_IN_THE_SOCIAL_SCIENCES_AND_HUMANITIES"}] |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176711] {},Node[31000021]{name:"PROFESSIONAL_AND_MANAGEMENT_DEVELOPMENT_TRAINING"}]               |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176710] {},Node[17063214]{name:"EDUCATIONAL_SUPPORT_SERVICES"}]                                   |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176709] {},Node[14378617]{name:"COLLEGES_UNIVERSITIES_AND_PROFESSIONAL_SCHOOLS"}]                 |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176708] {},Node[13015771]{name:"ALL_OTHER_PROFESSIONAL_SCIENTIFIC_AND_TECHNICAL_SERVICES"}]       |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
29 ms
 
 -- QUESTION: show me all contracts signed in 2009 (using the year component alone)
 
 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:partOf]->(k),s=(t)-[:isExecutedDuring]->(k) WHERE x.value2=2009 RETURN t,p,q,r,s LIMIT 5;


START yr=node:contractsNodesIndex(name='Year'),yr_2009=node:contractsNodesIndex(name='2009') MATCH p=(yr_2009)-[:is_a]->(yr),q=(yr_2009)-[:partOf]->(l),r=(l)-[:partOf]->(k),s=(t)-[:isExecutedDuring]->(k) RETURN t,p,q,r,s LIMIT 5;


+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| t                                           | p                                                                              | q                                                                                     | r                                                                                                    | s                                                                                                                         |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[33278913]{name:"W31P4Q09C0334"}        | [Node[39958565]{value2:2009},:is_a[1569160488] {},Node[34593192]{name:"Year"}] | [Node[39958565]{value2:2009},:partOf[1569100543] {},Node[5198117]{name:"2009-12-31"}] | [Node[5198117]{name:"2009-12-31"},:partOf[900653402] {},Node[5198708]{name:"2009-12-31_2060-12-25"}] | [Node[33278913]{name:"W31P4Q09C0334"},:isExecutedDuring[582901718] {},Node[5198708]{name:"2009-12-31_2060-12-25"}]        |
| Node[26999146]{name:"SP060006C8254"}        | [Node[39958565]{value2:2009},:is_a[1569160488] {},Node[34593192]{name:"Year"}] | [Node[39958565]{value2:2009},:partOf[1569100543] {},Node[5198117]{name:"2009-12-31"}] | [Node[5198117]{name:"2009-12-31"},:partOf[900653401] {},Node[5198707]{name:"2009-12-31_2045-09-24"}] | [Node[26999146]{name:"SP060006C8254"},:isExecutedDuring[582901717] {},Node[5198707]{name:"2009-12-31_2045-09-24"}]        |
| Node[10293162]{name:"DEDT0001059"}          | [Node[39958565]{value2:2009},:is_a[1569160488] {},Node[34593192]{name:"Year"}] | [Node[39958565]{value2:2009},:partOf[1569100543] {},Node[5198117]{name:"2009-12-31"}] | [Node[5198117]{name:"2009-12-31"},:partOf[900653400] {},Node[5198706]{name:"2009-12-31_2030-12-30"}] | [Node[10293162]{name:"DEDT0001059"},:isExecutedDuring[582901716] {},Node[5198706]{name:"2009-12-31_2030-12-30"}]          |
| Node[21729879]{name:"HUDCPHI01077PHIT0001"} | [Node[39958565]{value2:2009},:is_a[1569160488] {},Node[34593192]{name:"Year"}] | [Node[39958565]{value2:2009},:partOf[1569100543] {},Node[5198117]{name:"2009-12-31"}] | [Node[5198117]{name:"2009-12-31"},:partOf[900653399] {},Node[5198705]{name:"2009-12-31_2030-11-30"}] | [Node[21729879]{name:"HUDCPHI01077PHIT0001"},:isExecutedDuring[582901715] {},Node[5198705]{name:"2009-12-31_2030-11-30"}] |
| Node[33335217]{name:"W58RGZ05C0302"}        | [Node[39958565]{value2:2009},:is_a[1569160488] {},Node[34593192]{name:"Year"}] | [Node[39958565]{value2:2009},:partOf[1569100543] {},Node[5198117]{name:"2009-12-31"}] | [Node[5198117]{name:"2009-12-31"},:partOf[900653398] {},Node[5198704]{name:"2009-12-31_2030-09-08"}] | [Node[33335217]{name:"W58RGZ05C0302"},:isExecutedDuring[582901714] {},Node[5198704]{name:"2009-12-31_2030-09-08"}]        |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
1 ms 
 
 -- QUESTION: show me all contracts signed in 2010 by org x
 
 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:begins]->(k),s=(t)-[:isExecutedDuring]->(k),lvm=(t)-[:isManagedBy]->(rrl) WHERE x.value2=2010 AND rrl.name="DEPT_OF_DEFENSE" RETURN t,p,q,r,s,lvm LIMIT 5;

START yr=node:contractsNodesIndex(name='Year'),yr_2010=node:contractsNodesIndex(name='2010') MATCH p=(yr_2010)-[:is_a]->(yr),q=(yr_2010)-[:partOf]->(l),r=(l)-[:begins]->(k),s=(t)-[:isExecutedDuring]->(k),lvm=(t)-[:isManagedBy]->(rrl) WHERE rrl.name="DEPT_OF_DEFENSE" RETURN t,p,q,r,s,lvm LIMIT 5;

+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| t                                    | p                                                                              | q                                                                                     | r                                                                                                    | s                                                                                                                  | lvm                                                                                                      |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[386776]{name:"0008"}            | [Node[39958566]{value2:2010},:is_a[1569160489] {},Node[34593192]{name:"Year"}] | [Node[39958566]{value2:2010},:partOf[1569100908] {},Node[5449791]{name:"2010-12-31"}] | [Node[5449791]{name:"2010-12-31"},:begins[453699850] {},Node[5450018]{name:"2010-12-31_2030-04-10"}] | [Node[386776]{name:"0008"},:isExecutedDuring[549260659] {},Node[5450018]{name:"2010-12-31_2030-04-10"}]            | [Node[386776]{name:"0008"},:isManagedBy[677551179] {},Node[10312668]{name:"DEPT_OF_DEFENSE"}]            |
| Node[239837]{name:"0002"}            | [Node[39958566]{value2:2010},:is_a[1569160489] {},Node[34593192]{name:"Year"}] | [Node[39958566]{value2:2010},:partOf[1569100908] {},Node[5449791]{name:"2010-12-31"}] | [Node[5449791]{name:"2010-12-31"},:begins[453699848] {},Node[5450016]{name:"2010-12-31_2020-11-21"}] | [Node[239837]{name:"0002"},:isExecutedDuring[548463386] {},Node[5450016]{name:"2010-12-31_2020-11-21"}]            | [Node[239837]{name:"0002"},:isManagedBy[677404791] {},Node[10312668]{name:"DEPT_OF_DEFENSE"}]            |
| Node[24557229]{name:"N4008510C9403"} | [Node[39958566]{value2:2010},:is_a[1569160489] {},Node[34593192]{name:"Year"}] | [Node[39958566]{value2:2010},:partOf[1569100908] {},Node[5449791]{name:"2010-12-31"}] | [Node[5449791]{name:"2010-12-31"},:begins[453699847] {},Node[5450015]{name:"2010-12-31_2020-04-25"}] | [Node[24557229]{name:"N4008510C9403"},:isExecutedDuring[585883579] {},Node[5450015]{name:"2010-12-31_2020-04-25"}] | [Node[24557229]{name:"N4008510C9403"},:isManagedBy[685889756] {},Node[10312668]{name:"DEPT_OF_DEFENSE"}] |
| Node[239837]{name:"0002"}            | [Node[39958566]{value2:2010},:is_a[1569160489] {},Node[34593192]{name:"Year"}] | [Node[39958566]{value2:2010},:partOf[1569100908] {},Node[5449791]{name:"2010-12-31"}] | [Node[5449791]{name:"2010-12-31"},:begins[453699842] {},Node[5450010]{name:"2010-12-31_2014-12-31"}] | [Node[239837]{name:"0002"},:isExecutedDuring[548463385] {},Node[5450010]{name:"2010-12-31_2014-12-31"}]            | [Node[239837]{name:"0002"},:isManagedBy[677404791] {},Node[10312668]{name:"DEPT_OF_DEFENSE"}]            |
| Node[23816610]{name:"N0001902C3002"} | [Node[39958566]{value2:2010},:is_a[1569160489] {},Node[34593192]{name:"Year"}] | [Node[39958566]{value2:2010},:partOf[1569100908] {},Node[5449791]{name:"2010-12-31"}] | [Node[5449791]{name:"2010-12-31"},:begins[453699841] {},Node[5450009]{name:"2010-12-31_2014-10-31"}] | [Node[23816610]{name:"N0001902C3002"},:isExecutedDuring[585883574] {},Node[5450009]{name:"2010-12-31_2014-10-31"}] | [Node[23816610]{name:"N0001902C3002"},:isManagedBy[685323337] {},Node[10312668]{name:"DEPT_OF_DEFENSE"}] |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
10798 ms 

 -- QUESTION: show me all business events generated in 2012

 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:partOf]->(k),s=(t)-[:isExecutedDuring]->(k),sm=(t)-[:is_a]->(ttl)-[:is_a]->(ttv) WHERE x.value2=2012 RETURN t,p,q,r,s,sm LIMIT 5;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| t                                           | p                                                                              | q                                                                                     | r                                                                                                    | s                                                                                                                         | sm                                                                                                                                                        |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[21729879]{name:"HUDCPHI01077PHIT0001"} | [Node[39958568]{value2:2012},:is_a[1569160491] {},Node[34593192]{name:"Year"}] | [Node[39958568]{value2:2012},:partOf[1569101639] {},Node[5969823]{name:"2012-12-31"}] | [Node[5969823]{name:"2012-12-31"},:partOf[901422045] {},Node[5970332]{name:"2012-12-31_2030-11-30"}] | [Node[21729879]{name:"HUDCPHI01077PHIT0001"},:isExecutedDuring[591008567] {},Node[5970332]{name:"2012-12-31_2030-11-30"}] | [Node[21729879]{name:"HUDCPHI01077PHIT0001"},:is_a[799253054] {},Node[9184479]{name:"Contract"},:is_a[1569218974] {},Node[8384692]{name:"BusinessEvent"}] |
| Node[12810859]{name:"FA880812C0010"}        | [Node[39958568]{value2:2012},:is_a[1569160491] {},Node[34593192]{name:"Year"}] | [Node[39958568]{value2:2012},:partOf[1569101639] {},Node[5969823]{name:"2012-12-31"}] | [Node[5969823]{name:"2012-12-31"},:partOf[901422044] {},Node[5970331]{name:"2012-12-31_2022-01-24"}] | [Node[12810859]{name:"FA880812C0010"},:isExecutedDuring[591008566] {},Node[5970331]{name:"2012-12-31_2022-01-24"}]        | [Node[12810859]{name:"FA880812C0010"},:is_a[790519838] {},Node[9184479]{name:"Contract"},:is_a[1569218974] {},Node[8384692]{name:"BusinessEvent"}]        |
| Node[33407736]{name:"W90U4212P2110"}        | [Node[39958568]{value2:2012},:is_a[1569160491] {},Node[34593192]{name:"Year"}] | [Node[39958568]{value2:2012},:partOf[1569101639] {},Node[5969823]{name:"2012-12-31"}] | [Node[5969823]{name:"2012-12-31"},:partOf[901422043] {},Node[5970330]{name:"2012-12-31_2020-07-30"}] | [Node[33407736]{name:"W90U4212P2110"},:isExecutedDuring[591008565] {},Node[5970330]{name:"2012-12-31_2020-07-30"}]        | [Node[33407736]{name:"W90U4212P2110"},:is_a[809927173] {},Node[9184479]{name:"Contract"},:is_a[1569218974] {},Node[8384692]{name:"BusinessEvent"}]        |
| Node[11656890]{name:"DTOS5913F01021"}       | [Node[39958568]{value2:2012},:is_a[1569160491] {},Node[34593192]{name:"Year"}] | [Node[39958568]{value2:2012},:partOf[1569101639] {},Node[5969823]{name:"2012-12-31"}] | [Node[5969823]{name:"2012-12-31"},:partOf[901422042] {},Node[5970329]{name:"2012-12-31_2020-04-06"}] | [Node[11656890]{name:"DTOS5913F01021"},:isExecutedDuring[591008564] {},Node[5970329]{name:"2012-12-31_2020-04-06"}]       | [Node[11656890]{name:"DTOS5913F01021"},:is_a[789420050] {},Node[9184479]{name:"Contract"},:is_a[1569218974] {},Node[8384692]{name:"BusinessEvent"}]       |
| Node[33467105]{name:"W911QY10F0243"}        | [Node[39958568]{value2:2012},:is_a[1569160491] {},Node[34593192]{name:"Year"}] | [Node[39958568]{value2:2012},:partOf[1569101639] {},Node[5969823]{name:"2012-12-31"}] | [Node[5969823]{name:"2012-12-31"},:partOf[901422041] {},Node[5970328]{name:"2012-12-31_2020-02-17"}] | [Node[33467105]{name:"W911QY10F0243"},:isExecutedDuring[591008563] {},Node[5970328]{name:"2012-12-31_2020-02-17"}]        | [Node[33467105]{name:"W911QY10F0243"},:is_a[809986534] {},Node[9184479]{name:"Contract"},:is_a[1569218974] {},Node[8384692]{name:"BusinessEvent"}]        |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
3 ms
 
 -- QUESTION: show me all business events generated by org x in 2000

 -- QUERY: neo4j-sh (0)$ START year=node:contractsNodesIndex(name='Year'),org=node:contractsNodesIndex(name='MAK_TECHNOLOGIES_INC'),ct=node:contractsNodesIndex(name='Contract'),be=node:contractsNodesIndex(name='BusinessEvent'),yearValue=node:contractsNodesIndex(value2='2000') MATCH path1=(yearValue)-[:is_a]->(year),path2=(yearValue)-[:partOf]->(date)-[:begins]->(date_range),path3=(contract)-[:isExecutedDuring]->(date_range),path4=(contract)-[:isAwardedTo]->(org) WHERE (contract)-[:is_a]->(ct)-[:is_a]->(be) RETURN path1,path2,path3,path4 LIMIT 5;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| path1                                                                          | path2                                                                                                                                                   | path3                                                                                                     | path4                                                                                                |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[39958556]{value2:2000},:is_a[1569160479] {},Node[34593192]{name:"Year"}] | [Node[39958556]{value2:2000},:partOf[1569097247] {},Node[3488713]{name:"2000-12-22"},:begins[451753137] {},Node[3488916]{name:"2000-12-22_2001-09-30"}] | [Node[39958721]{value2:5011},:isExecutedDuring[562608776] {},Node[3488916]{name:"2000-12-22_2001-09-30"}] | [Node[39958721]{value2:5011},:isAwardedTo[318756832] {},Node[23450511]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[39958556]{value2:2000},:is_a[1569092297] {},Node[34593192]{name:"Year"}] | [Node[39958556]{value2:2000},:partOf[1569097247] {},Node[3488713]{name:"2000-12-22"},:begins[451753137] {},Node[3488916]{name:"2000-12-22_2001-09-30"}] | [Node[39958721]{value2:5011},:isExecutedDuring[562608776] {},Node[3488916]{name:"2000-12-22_2001-09-30"}] | [Node[39958721]{value2:5011},:isAwardedTo[318756832] {},Node[23450511]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[39958556]{value2:2000},:is_a[1569160479] {},Node[34593192]{name:"Year"}] | [Node[39958556]{value2:2000},:partOf[1569097244] {},Node[3487496]{name:"2000-12-19"},:begins[451751951] {},Node[3487726]{name:"2000-12-19_2001-09-29"}] | [Node[39958721]{value2:5011},:isExecutedDuring[562606212] {},Node[3487726]{name:"2000-12-19_2001-09-29"}] | [Node[39958721]{value2:5011},:isAwardedTo[318756832] {},Node[23450511]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[39958556]{value2:2000},:is_a[1569092297] {},Node[34593192]{name:"Year"}] | [Node[39958556]{value2:2000},:partOf[1569097244] {},Node[3487496]{name:"2000-12-19"},:begins[451751951] {},Node[3487726]{name:"2000-12-19_2001-09-29"}] | [Node[39958721]{value2:5011},:isExecutedDuring[562606212] {},Node[3487726]{name:"2000-12-19_2001-09-29"}] | [Node[39958721]{value2:5011},:isAwardedTo[318756832] {},Node[23450511]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[39958556]{value2:2000},:is_a[1569160479] {},Node[34593192]{name:"Year"}] | [Node[39958556]{value2:2000},:partOf[1569097244] {},Node[3487496]{name:"2000-12-19"},:begins[451751773] {},Node[3487548]{name:"2000-12-19_2000-11-30"}] | [Node[39958721]{value2:5011},:isExecutedDuring[562605823] {},Node[3487548]{name:"2000-12-19_2000-11-30"}] | [Node[39958721]{value2:5011},:isAwardedTo[318756832] {},Node[23450511]{name:"MAK_TECHNOLOGIES_INC"}] |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
102082 ms


 -- QUESTION: show all contracts for the amount range 1m - 10m executed in WASHINGTON_984241000

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name='Contract'),ttl=node:contractsNodesIndex(name='WASHINGTON_984241000') MATCH pvm=(x)-[:isExecutedIn]->(ttl), svm=(x)-[:hasContractValue]->(lvm) WHERE lvm.value1>1000000 AND lvm.value1<10000000 AND (x)-[:isExecutedIn]->(ttl) RETURN svm,pvm LIMIT 5;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| svm                                                                                                      | pvm                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[15240752]{name:"DADA1302F0011"},:hasContractValue[1298935578] {},Node[3774590]{value1:1500000.0}]  | [Node[15240752]{name:"DADA1302F0011"},:isExecutedIn[502315649] {},Node[39598657]{name:"WASHINGTON_984241000"}] |
| [Node[15240752]{name:"DADA1302F0011"},:hasContractValue[1298935576] {},Node[10657998]{value1:6400000.0}] | [Node[15240752]{name:"DADA1302F0011"},:isExecutedIn[502315649] {},Node[39598657]{name:"WASHINGTON_984241000"}] |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
2 rows
3 ms
 
 -- QUESTION: contracts ending this fiscal year

 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:ends]->(k),s=(t)-[:isExecutedDuring]->(k) WHERE x.value2=2013 RETURN p,q,r,s LIMIT 5;
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                              | q                                                                                     | r                                                                                                  | s                                                                                                                  |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[39958569]{value2:2013},:is_a[1569160492] {},Node[34593192]{name:"Year"}] | [Node[39958569]{value2:2013},:partOf[1569101965] {},Node[5978168]{name:"2013-12-31"}] | [Node[5978168]{name:"2013-12-31"},:ends[327398886] {},Node[6158875]{name:"3013-01-01_2013-12-31"}] | [Node[32668447]{name:"VA11812F0022"},:isExecutedDuring[591050985] {},Node[6158875]{name:"3013-01-01_2013-12-31"}]  |
| [Node[39958569]{value2:2013},:is_a[1569160492] {},Node[34593192]{name:"Year"}] | [Node[39958569]{value2:2013},:partOf[1569101965] {},Node[5978168]{name:"2013-12-31"}] | [Node[5978168]{name:"2013-12-31"},:ends[327398885] {},Node[6158589]{name:"3011-03-28_2013-12-31"}] | [Node[28505642]{name:"TDO11F128"},:isExecutedDuring[591050959] {},Node[6158589]{name:"3011-03-28_2013-12-31"}]     |
| [Node[39958569]{value2:2013},:is_a[1569160492] {},Node[34593192]{name:"Year"}] | [Node[39958569]{value2:2013},:partOf[1569101965] {},Node[5978168]{name:"2013-12-31"}] | [Node[5978168]{name:"2013-12-31"},:ends[327398884] {},Node[6004460]{name:"2102-11-19_2013-12-31"}] | [Node[28744645]{name:"TPDTTB1100013"},:isExecutedDuring[591050717] {},Node[6004460]{name:"2102-11-19_2013-12-31"}] |
| [Node[39958569]{value2:2013},:is_a[1569160492] {},Node[34593192]{name:"Year"}] | [Node[39958569]{value2:2013},:partOf[1569101965] {},Node[5978168]{name:"2013-12-31"}] | [Node[5978168]{name:"2013-12-31"},:ends[327398883] {},Node[5978176]{name:"2013-12-31_2013-12-31"}] | [Node[34711204]{name:"ZZ04"},:isExecutedDuring[591049744] {},Node[5978176]{name:"2013-12-31_2013-12-31"}]          |
| [Node[39958569]{value2:2013},:is_a[1569160492] {},Node[34593192]{name:"Year"}] | [Node[39958569]{value2:2013},:partOf[1569101965] {},Node[5978168]{name:"2013-12-31"}] | [Node[5978168]{name:"2013-12-31"},:ends[327398883] {},Node[5978176]{name:"2013-12-31_2013-12-31"}] | [Node[26644383]{name:"SIN29213M0040"},:isExecutedDuring[591049743] {},Node[5978176]{name:"2013-12-31_2013-12-31"}] |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
1 ms

 -- QUESTION: contracts for janitorial services funded by GSA

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name='Contract'),pqr=node:contractsNodesIndex(name='GSA/PUBLIC_BUILDINGS_SERVICE'),rms=node:contractsNodesIndex(name='JANITORIAL_SERVICES') MATCH (x)-[:is_a]->(n), lvm=(x)-[:isFundedBy]->(pqr),pvm=(x)-[:hasDeliverables]->(rms) RETURN lvm,pvm LIMIT 5;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| lvm                                                                                                                 | pvm                                                                                                             |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[9973411]{name:"DACW6801C0025"},:isFundedBy[629297167] {},Node[14605177]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}] | [Node[9973411]{name:"DACW6801C0025"},:hasDeliverables[103331266] {},Node[22657652]{name:"JANITORIAL_SERVICES"}] |
| [Node[9882344]{name:"DACA6302P0163"},:isFundedBy[629270417] {},Node[14605177]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}] | [Node[9882344]{name:"DACA6302P0163"},:hasDeliverables[103307682] {},Node[22657652]{name:"JANITORIAL_SERVICES"}] |
| [Node[9812523]{name:"DABN0903C0008"},:isFundedBy[629251828] {},Node[14605177]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}] | [Node[9812523]{name:"DABN0903C0008"},:hasDeliverables[103289856] {},Node[22657652]{name:"JANITORIAL_SERVICES"}] |
| [Node[39958751]{value2:9999},:isFundedBy[636043174] {},Node[14605177]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}]         | [Node[39958751]{value2:9999},:hasDeliverables[112383471] {},Node[22657652]{name:"JANITORIAL_SERVICES"}]         |
| [Node[39958746]{value2:9009},:isFundedBy[636043173] {},Node[14605177]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}]         | [Node[39958746]{value2:9009},:hasDeliverables[112383468] {},Node[22657652]{name:"JANITORIAL_SERVICES"}]         |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
134064 ms 
 
 -- QUESTION: how many contracts does IBM have currently in progress?

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name='IBM') MATCH p=(t)-[:isAwardedTo]->(n) RETURN COUNT(p);
+----------+
| COUNT(p) |
+----------+
| 584      |
+----------+
1 row
0 ms
 
 
-- QUESTION: SHOW ME ALL THE CONTRACTS FUNDED BY BUREAU OF NEAR EASTERN AFFAIRS --
 
 -- QUERY: START n=node:node_auto_index(name = 'BUREAU OF NEAR EASTERN AFFAIRS') MATCH (x)-[:isFundedBy]->(n) RETURN x
 
+----------------------------------+
| x                                |
+----------------------------------+
| Node[1655]{name:"SJO10013A0008"} |
| Node[1657]{name:"SJO10013A0012"} |
| Node[1659]{name:"SJO10013A0015"} |
| Node[1661]{name:"SJO10013A0024"} |
+----------------------------------+
4 rows
238 ms
 
 -- QUESTION: What office is funding CONTRACT GS35F0119Y --
 
 -- QUERY: START n=node:node_auto_index(name = 'GS35F0119Y') MATCH (n)-[:isFundedBy]->(x) RETURN x
 
+---------------------------------------------------------+
| x                                                       |
+---------------------------------------------------------+
| Node[3441]{name:"FAS HEARTLAND REGIONAL ADMINISTRATOR"} |
+---------------------------------------------------------+
1 row
2 ms
 
 -- QUESTION: How much is CONTRACT SPM5E113D5A07 --
 
 -- QUERY: START n=node:node_auto_index(name = 'SPM5E113D5A07') MATCH (n)-[:hasContractValue]->(x) RETURN x
 
+-------------------------------------------+
| x                                         |
+-------------------------------------------+
| Node[3149]{name:"150000.000000000000000"} |
+-------------------------------------------+
1 row
2 ms
 
 -- QUESTION: SHOW ME CONTRACTS FUNDED BY DLA TROOP SUPPORT AND MANAGED BY DEPT OF DEFENSE --
 
 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name = 'DLA_TROOP_SUPPORT'),m=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE') MATCH path=(n)<-[:isFundedBy]-(x)-[:isManagedBy]->(m) RETURN x, path LIMIT 5;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| x                          | path                                                                                                                                                              |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[9999807]{name:"5069"} | [Node[16592486]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[565683185] {},Node[9999807]{name:"5069"},:isManagedBy[653643439] {},Node[15544958]{name:"DEPT_OF_DEFENSE"}] |
| Node[9999394]{name:"5068"} | [Node[16592486]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[565683117] {},Node[9999394]{name:"5068"},:isManagedBy[653643393] {},Node[15544958]{name:"DEPT_OF_DEFENSE"}] |
| Node[9998945]{name:"5067"} | [Node[16592486]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[565683047] {},Node[9998945]{name:"5067"},:isManagedBy[653643339] {},Node[15544958]{name:"DEPT_OF_DEFENSE"}] |
| Node[9998517]{name:"5066"} | [Node[16592486]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[565682972] {},Node[9998517]{name:"5066"},:isManagedBy[653643283] {},Node[15544958]{name:"DEPT_OF_DEFENSE"}] |
| Node[9998093]{name:"5065"} | [Node[16592486]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[565682904] {},Node[9998093]{name:"5065"},:isManagedBy[653643233] {},Node[15544958]{name:"DEPT_OF_DEFENSE"}] |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
0 ms
 
 -- QUESTION: SHOW ME ALL THE BUSINESS EVENTS HANDLED BY GSA --
 
 -- QUERY: START n=node:node_auto_index(name = 'BusinessEvent'),m=node:node_auto_index({regex}) MATCH p=(n)-[*1..2]-(m) RETURN p", params);


START n=node:contractsNodesIndex(name = 'BusinessEvent'),m=node:contractsNodesIndex("name:GSA*") MATCH (t)-[:is_a]->(x)-[:is_a]->(n), (t)-[:isFundedBy]->(m) RETURN t;

START n=node:contractsNodesIndex(name = 'BusinessEvent'),m=node:contractsNodesIndex("name:GSA*") MATCH (x)-[:is_a]->(n), (t)-[:is_a]->(x) WHERE (t)-[:isFundedBy]->(m) RETURN t;
 
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                                                                                              |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[10]{name:"BusinessEvent"},:is_a[5477] {alias:"is a"},Node[1099]{name:"GS06F0186Z"},:isFundedBy[7395] {alias:"isFundedBy"},Node[3446]{name:"GSA/ITS/GWAC CONTRACT OPERATIONS BRANCH C"}]                  |
| [Node[10]{name:"BusinessEvent"},:is_a[5473] {alias:"is a"},Node[1091]{name:"GS03P06CDA0038"},:isFundedBy[7391] {alias:"isFundedBy"},Node[3443]{name:"GSA/PBS/R03 REGIONALCONTRACTS SUPPORT SERVICES SECTION"}] |
| [Node[10]{name:"BusinessEvent"},:is_a[5467] {alias:"is a"},Node[1079]{name:"GS02P05PWC0018"},:isFundedBy[7385] {alias:"isFundedBy"},Node[3442]{name:"GSA/PUBLIC BUILDINGS SERVICE"}]                           |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
3 rows
608 ms
 
 -- QUESTION: SHOW ME ALL THE BUSINESS EVENTS FUNDED BY W0ML USA DEP TOBYHANNA AND MANAGED BY DEPT OF DEFENSE --
 
 -- QUERY: START n=node:node_auto_index(name = 'BusinessEvent'),m=node:node_auto_index(name = 'W0ML USA DEP TOBYHANNA'),l=node:node_auto_index(name = 'DEPT OF DEFENSE') MATCH p=n-[r]-x-[*1..2]-l WHERE m-[:isFundedBy]-x-[:isManagedBy]-l  RETURN x, p
 
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| x                                | p                                                                                                                                                                        |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[1866]{name:"W25G1V12A0279"} | [Node[10]{name:"BusinessEvent"},:is_a[5852] {alias:"is a"},Node[1866]{name:"W25G1V12A0279"},:isManagedBy[8729] {alias:"isManagedBy"},Node[3592]{name:"DEPT OF DEFENSE"}] |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row
599 ms
 
 -- QUESTION: SHOW ME ALL CONTRACTS THAT BEGIN ON DATE 1983-08-02 --
 
 -- QUERY: START n=node:contractsNodesIndex(name = 'Contract'),m=node:contractsNodesIndex(name = '1983-08-02'),p=node:contractsNodesIndex(name = 'Date') MATCH (m)-[:is_a]->(p),(m)-[:begins]->(plm),(x)-[:isExecutedDuring]->(plm) WHERE (x)-[:is_a]->(n) RETURN x;
+----------------------------------------+
| x                                      |
+----------------------------------------+
| Node[15487769]{name:"DEAC0483AL18796"} |
+----------------------------------------+
1 row
198491 ms
 
 -- QUESTION: SHOW ME DETAILS OF CONTRACT YF020199009C0488F1962888D0039 --
 
 -- QUERY: START n=node:contractsNodesIndex(name = 'YF020199009C0488F1962888D0039') MATCH path1=(n)-[r]->(x) RETURN path1;
+----------------------------------------------------------------------------------------------------------------------------------+
| path1                                                                                                                            |
+----------------------------------------------------------------------------------------------------------------------------------+
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasObligationValue[57883333] {},Node[9086401]{name:"36000"}]              |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasPart[177483233] {},Node[4623570]{name:"1990-09-15_"}]                  |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasPart[177483232] {},Node[38401927]{name:"VIRGINIA_"}]                   |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasPart[177483231] {},Node[17095563]{name:"ELECTRONIC_DATA_SYSTEMS"}]     |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:is_a[218055624] {},Node[14416769]{name:"Contract"}]                       |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isAwardedTo[320702727] {},Node[17095563]{name:"ELECTRONIC_DATA_SYSTEMS"}] |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isExecutedDuring[518241775] {},Node[4623570]{name:"1990-09-15_"}]         |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isExecutedIn[552358051] {},Node[38401927]{name:"VIRGINIA_"}]              |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isGivenTo[622263002] {},Node[17095563]{name:"ELECTRONIC_DATA_SYSTEMS"}]   |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isManagedBy[652585698] {},Node[15545121]{name:"DEPT_OF_THE_AIR_FORCE"}]   |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isPerformedDuring[733287387] {},Node[4623570]{name:"1990-09-15_"}]        |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isPerformedIn[767403662] {},Node[38401927]{name:"VIRGINIA_"}]             |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasActionValue[1363412732] {},Node[9086401]{name:"36000"}]                |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasContractValue[1401324658] {},Node[18]{name:"0"}]                       |
+----------------------------------------------------------------------------------------------------------------------------------+
14 rows
3 ms
 
 -- QUESTION: SHOW ME ALL THE CONTRACTS THAT BEGIN IN 1983, ENDED IN YEAR 1993 AND ARE MANAGED BY DEPT OF DEFENSE --
 
 -- QUERY: START n=node:node_auto_index(name = 'Contract'),m=node:node_auto_index({regex1}),l=node:node_auto_index({regex2}),p=node:node_auto_index({regex3}) MATCH n-[:is_a]-x-[:ends]-l, p-[:isManagedBy]-x-[:begins]-m RETURN x

START n=node:contractsNodesIndex(name = 'Contract'),m=node:contractsNodesIndex(value2 = '1983'),p=node:contractsNodesIndex(value2 = '1993'),q=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE') MATCH (x)-[:isManagedBy]->(q),(x)-[:isExecutedDuring]->(pmn),(m)-[:begins]->(pmn),(p)-[:ends]->(pmn) WHERE (x)-[:is_a]->(n) RETURN x LIMIT 5;


START n=node:contractsNodesIndex(name = 'Contract'),m=node:contractsNodesIndex(value2 = '1983'),p=node:contractsNodesIndex(value2 = '1993'),t=node:contractsNodesIndex(name = 'Year'), q=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE') MATCH (x)-[:is_a]->(n), (x)-[:isManagedBy]->(q), (m)-[:is_a]->(t), (p)-[:is_a]->(t) RETURN x LIMIT 10;
 
+--------------------------------------------------+
| x                                                |
+--------------------------------------------------+
| Node[1565]{name:"N6523611D4801"}                 |
| Node[1309]{name:"HDEC0512D0006"}                 |
| Node[1380]{name:"HT001112A0010"}                 |
| Node[1382]{name:"HT001112A0068"}                 |
| Node[1395]{name:"HTC71112DW012"}                 |
| Node[1878]{name:"W52P1J12G0018"}                 |
| Node[1904]{name:"W911S011D0015"}                 |
| Node[1898]{name:"W911RX13D0001"}                 |
| Node[1924]{name:"W912HN10D0063"}                 |
| Node[1930]{name:"W912L613A0002"}                 |
| Node[1912]{name:"W9124D09D0011"}                 |
| Node[1948]{name:"W912P911D0501"}                 |
| Node[1970]{name:"ZD030199009C2041MDA90390D0035"} |
+--------------------------------------------------+
13 rows
722 ms
