 -- QUESTION: Show me all components of Contract x

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name="00000199609C0398F1963093D0001") MATCH p=(n)-[:is_a]->(l),q=(n)-[]->(x) RETURN p,q;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                      | q                                                                                                                                            |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasDeliverables[18495826] {},Node[14649082]{name:"CUSTOM_COMPUTER_PROGRAMMING_SERVICES"}] |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasObligationValue[58501037] {},Node[10942195]{name:"71000"}]                             |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061189] {},Node[4648182]{name:"1996-09-15_2001-10-15"}]                        |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061147] {},Node[38401927]{name:"VIRGINIA_"}]                                   |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061113] {},Node[30991014]{name:"PRC_INC."}]                                    |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasPart[179061045] {},Node[14649082]{name:"CUSTOM_COMPUTER_PROGRAMMING_SERVICES"}]        |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}]                                       |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isAwardedTo[321097054] {},Node[30991014]{name:"PRC_INC."}]                                |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isExecutedDuring[518851606] {},Node[4648182]{name:"1996-09-15_2001-10-15"}]               |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isExecutedIn[552804697] {},Node[38401927]{name:"VIRGINIA_"}]                              |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isGivenTo[622657329] {},Node[30991014]{name:"PRC_INC."}]                                  |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isManagedBy[652906076] {},Node[15533062]{name:"DEFENSE_LOGISTICS_AGENCY"}]                |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isPerformedDuring[733897218] {},Node[4648182]{name:"1996-09-15_2001-10-15"}]              |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:isPerformedIn[767850308] {},Node[38401927]{name:"VIRGINIA_"}]                             |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasActionValue[1148189637] {},Node[10942195]{name:"71000"}]                               |
| [Node[4997]{name:"00000199609C0398F1963093D0001"},:is_a[218964648] {},Node[14416769]{name:"Contract"}] | [Node[4997]{name:"00000199609C0398F1963093D0001"},:hasContractValue[1185953118] {},Node[18]{name:"0"}]                                       |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
16 rows
1549 ms
 
 -- QUESTION: Show me all contracts managed by org x and funded by org x

 -- QUERY: neo4j-sh (0)$ START m=node:contractsNodesIndex(name = 'Contract'),l=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE'),svm=node:contractsNodesIndex(name = 'DLA_LAND_AND_MARITIME')  MATCH (n)-[:is_a]-(m),(n)-[:isManagedBy]->(l),(n)-[:isFundedBy]->(svm) RETURN n LIMIT 5;
+-----------------------------+
| n                           |
+-----------------------------+
| Node[39943600]{name:"ZZL6"} |
| Node[39943599]{name:"ZZG8"} |
| Node[39943597]{name:"ZZDA"} |
| Node[39943595]{name:"ZZB6"} |
| Node[39943594]{name:"ZZB5"} |
+-----------------------------+
5 rows
7 ms
 
 -- QUESTION: Show me all the services that org x delivers
 
 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name = 'Organization'),x=node:contractsNodesIndex(name = 'WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS') MATCH p=(x)-[:is_a]-(n),m=(x)-[:delivers]->(l) RETURN p,m;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                 | m                                                                                                                                                                                        |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176712] {},Node[31323288]{name:"RESEARCH_AND_DEVELOPMENT_IN_THE_SOCIAL_SCIENCES_AND_HUMANITIES"}] |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176711] {},Node[31000021]{name:"PROFESSIONAL_AND_MANAGEMENT_DEVELOPMENT_TRAINING"}]               |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176710] {},Node[17063214]{name:"EDUCATIONAL_SUPPORT_SERVICES"}]                                   |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176709] {},Node[14378617]{name:"COLLEGES_UNIVERSITIES_AND_PROFESSIONAL_SCHOOLS"}]                 |
| [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:is_a[217976756] {},Node[30719996]{name:"Organization"}] | [Node[39757192]{name:"WOODROW_WILSON_INTERNATIONAL_CENTER_FOR_SCHOLARS"},:delivers[1014176708] {},Node[13015771]{name:"ALL_OTHER_PROFESSIONAL_SCIENTIFIC_AND_TECHNICAL_SERVICES"}]       |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
29 ms
 
 -- QUESTION: show me all contracts signed in 2009 (using the year component alone)
 
 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:partOf]->(k),s=(t)-[:isExecutedDuring]->(k) WHERE x.value2=2009 RETURN t,p,q,r,s LIMIT 5;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| t                           | p                                                                            | q                                                                                   | r                                                                                          | s                                                                                               |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[39958777]{name:"ZZZZ"} | [Node[6514479]{value2:2009},:is_a[175887148] {},Node[39840631]{name:"Year"}] | [Node[6514479]{value2:2009},:partOf[949897871] {},Node[6758427]{name:"2009-12-31"}] | [Node[6758427]{name:"2009-12-31"},:partOf[949899130] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958777]{name:"ZZZZ"},:isExecutedDuring[494130505] {},Node[15430750]{name:"DATE_RANGE"}] |
| Node[39958775]{name:"ZZZ9"} | [Node[6514479]{value2:2009},:is_a[175887148] {},Node[39840631]{name:"Year"}] | [Node[6514479]{value2:2009},:partOf[949897871] {},Node[6758427]{name:"2009-12-31"}] | [Node[6758427]{name:"2009-12-31"},:partOf[949899130] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958775]{name:"ZZZ9"},:isExecutedDuring[494130504] {},Node[15430750]{name:"DATE_RANGE"}] |
| Node[39958774]{name:"ZZZ8"} | [Node[6514479]{value2:2009},:is_a[175887148] {},Node[39840631]{name:"Year"}] | [Node[6514479]{value2:2009},:partOf[949897871] {},Node[6758427]{name:"2009-12-31"}] | [Node[6758427]{name:"2009-12-31"},:partOf[949899130] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958774]{name:"ZZZ8"},:isExecutedDuring[494130503] {},Node[15430750]{name:"DATE_RANGE"}] |
| Node[39958773]{name:"ZZZ7"} | [Node[6514479]{value2:2009},:is_a[175887148] {},Node[39840631]{name:"Year"}] | [Node[6514479]{value2:2009},:partOf[949897871] {},Node[6758427]{name:"2009-12-31"}] | [Node[6758427]{name:"2009-12-31"},:partOf[949899130] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958773]{name:"ZZZ7"},:isExecutedDuring[494130502] {},Node[15430750]{name:"DATE_RANGE"}] |
| Node[39958772]{name:"ZZZ6"} | [Node[6514479]{value2:2009},:is_a[175887148] {},Node[39840631]{name:"Year"}] | [Node[6514479]{value2:2009},:partOf[949897871] {},Node[6758427]{name:"2009-12-31"}] | [Node[6758427]{name:"2009-12-31"},:partOf[949899130] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958772]{name:"ZZZ6"},:isExecutedDuring[494130501] {},Node[15430750]{name:"DATE_RANGE"}] |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
1 ms
 
 -- QUESTION: show me all contracts signed in 2010 by org x
 
 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:begins]->(k),s=(t)-[:isExecutedDuring]->(k),lvm=(t)-[:isManagedBy]->(rrl) WHERE x.value2=2010 AND rrl.name="DEPT_OF_DEFENSE" RETURN t,p,q,r,s,lvm LIMIT 5;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| t                           | p                                                                            | q                                                                                   | r                                                                                          | s                                                                                               | lvm                                                                                             |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[39958777]{name:"ZZZZ"} | [Node[6760389]{value2:2010},:is_a[175889278] {},Node[39840631]{name:"Year"}] | [Node[6760389]{value2:2010},:partOf[949915130] {},Node[7011237]{name:"2010-12-31"}] | [Node[7011237]{name:"2010-12-31"},:begins[692638759] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958777]{name:"ZZZZ"},:isExecutedDuring[494130505] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958777]{name:"ZZZZ"},:isManagedBy[626248347] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958775]{name:"ZZZ9"} | [Node[6760389]{value2:2010},:is_a[175889278] {},Node[39840631]{name:"Year"}] | [Node[6760389]{value2:2010},:partOf[949915130] {},Node[7011237]{name:"2010-12-31"}] | [Node[7011237]{name:"2010-12-31"},:begins[692638759] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958775]{name:"ZZZ9"},:isExecutedDuring[494130504] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958775]{name:"ZZZ9"},:isManagedBy[626248346] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958774]{name:"ZZZ8"} | [Node[6760389]{value2:2010},:is_a[175889278] {},Node[39840631]{name:"Year"}] | [Node[6760389]{value2:2010},:partOf[949915130] {},Node[7011237]{name:"2010-12-31"}] | [Node[7011237]{name:"2010-12-31"},:begins[692638759] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958774]{name:"ZZZ8"},:isExecutedDuring[494130503] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958774]{name:"ZZZ8"},:isManagedBy[626248345] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958773]{name:"ZZZ7"} | [Node[6760389]{value2:2010},:is_a[175889278] {},Node[39840631]{name:"Year"}] | [Node[6760389]{value2:2010},:partOf[949915130] {},Node[7011237]{name:"2010-12-31"}] | [Node[7011237]{name:"2010-12-31"},:begins[692638759] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958773]{name:"ZZZ7"},:isExecutedDuring[494130502] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958773]{name:"ZZZ7"},:isManagedBy[626248344] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958772]{name:"ZZZ6"} | [Node[6760389]{value2:2010},:is_a[175889278] {},Node[39840631]{name:"Year"}] | [Node[6760389]{value2:2010},:partOf[949915130] {},Node[7011237]{name:"2010-12-31"}] | [Node[7011237]{name:"2010-12-31"},:begins[692638759] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958772]{name:"ZZZ6"},:isExecutedDuring[494130501] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958772]{name:"ZZZ6"},:isManagedBy[626248343] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
3 ms

 -- QUESTION: show me all business events generated in 2012

 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:partOf]->(k),s=(t)-[:isExecutedDuring]->(k),sm=(t)-[:is_a]->(ttl)-[:is_a]->(ttv) WHERE x.value2=2012 RETURN t,p,q,r,s,sm LIMIT 5;
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| t                           | p                                                                            | q                                                                                   | r                                                                                          | s                                                                                               | sm                                                                                                                                         |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[39958777]{name:"ZZZZ"} | [Node[7276210]{value2:2012},:is_a[175893573] {},Node[39840631]{name:"Year"}] | [Node[7276210]{value2:2012},:partOf[949931160] {},Node[7533497]{name:"2012-12-31"}] | [Node[7533497]{name:"2012-12-31"},:partOf[949932893] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958777]{name:"ZZZZ"},:isExecutedDuring[494130505] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958777]{name:"ZZZZ"},:is_a[208319201] {},Node[14431921]{name:"Contract"},:is_a[182787473] {},Node[13632138]{name:"BusinessEvent"}] |
| Node[39958775]{name:"ZZZ9"} | [Node[7276210]{value2:2012},:is_a[175893573] {},Node[39840631]{name:"Year"}] | [Node[7276210]{value2:2012},:partOf[949931160] {},Node[7533497]{name:"2012-12-31"}] | [Node[7533497]{name:"2012-12-31"},:partOf[949932893] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958775]{name:"ZZZ9"},:isExecutedDuring[494130504] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958775]{name:"ZZZ9"},:is_a[208319199] {},Node[14431921]{name:"Contract"},:is_a[182787473] {},Node[13632138]{name:"BusinessEvent"}] |
| Node[39958774]{name:"ZZZ8"} | [Node[7276210]{value2:2012},:is_a[175893573] {},Node[39840631]{name:"Year"}] | [Node[7276210]{value2:2012},:partOf[949931160] {},Node[7533497]{name:"2012-12-31"}] | [Node[7533497]{name:"2012-12-31"},:partOf[949932893] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958774]{name:"ZZZ8"},:isExecutedDuring[494130503] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958774]{name:"ZZZ8"},:is_a[208319198] {},Node[14431921]{name:"Contract"},:is_a[182787473] {},Node[13632138]{name:"BusinessEvent"}] |
| Node[39958773]{name:"ZZZ7"} | [Node[7276210]{value2:2012},:is_a[175893573] {},Node[39840631]{name:"Year"}] | [Node[7276210]{value2:2012},:partOf[949931160] {},Node[7533497]{name:"2012-12-31"}] | [Node[7533497]{name:"2012-12-31"},:partOf[949932893] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958773]{name:"ZZZ7"},:isExecutedDuring[494130502] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958773]{name:"ZZZ7"},:is_a[208319197] {},Node[14431921]{name:"Contract"},:is_a[182787473] {},Node[13632138]{name:"BusinessEvent"}] |
| Node[39958772]{name:"ZZZ6"} | [Node[7276210]{value2:2012},:is_a[175893573] {},Node[39840631]{name:"Year"}] | [Node[7276210]{value2:2012},:partOf[949931160] {},Node[7533497]{name:"2012-12-31"}] | [Node[7533497]{name:"2012-12-31"},:partOf[949932893] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958772]{name:"ZZZ6"},:isExecutedDuring[494130501] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958772]{name:"ZZZ6"},:is_a[208319196] {},Node[14431921]{name:"Contract"},:is_a[182787473] {},Node[13632138]{name:"BusinessEvent"}] |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
48 ms
 
 -- QUESTION: show me all business events generated by org x in 2000

 -- QUERY: neo4j-sh (0)$ START year=node:contractsNodesIndex(name='Year'),org=node:contractsNodesIndex(name='MAK_TECHNOLOGIES_INC'),ct=node:contractsNodesIndex(name='Contract'),be=node:contractsNodesIndex(name='BusinessEvent'),yearValue=node:contractsNodesIndex(value2='2000') MATCH path1=(yearValue)-[:is_a]->(year),path2=(yearValue)-[:partOf]->(date)-[:begins]->(date_range),path3=(contract)-[:isExecutedDuring]->(date_range),path4=(contract)-[:isAwardedTo]->(org) WHERE (contract)-[:is_a]->(ct)-[:is_a]->(be) RETURN path1,path2,path3,path4 LIMIT 5;
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| path1                                                                        | path2                                                                                                                                       | path3                                                                                                    | path4                                                                                                         |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[4932554]{value2:2000},:is_a[175852345] {},Node[39840631]{name:"Year"}] | [Node[4932554]{value2:2000},:partOf[949624556] {},Node[5040387]{name:"2000-12-31"},:begins[692635107] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39554014]{name:"W91ZLK09P0905"},:isExecutedDuring[493814999] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39554014]{name:"W91ZLK09P0905"},:isAwardedTo[308475699] {},Node[28697949]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[4932554]{value2:2000},:is_a[175852345] {},Node[39840631]{name:"Year"}] | [Node[4932554]{value2:2000},:partOf[949624556] {},Node[5040387]{name:"2000-12-31"},:begins[692635107] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39544322]{name:"W91ZLK05P1091"},:isExecutedDuring[493805307] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39544322]{name:"W91ZLK05P1091"},:isAwardedTo[308465978] {},Node[28697949]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[4932554]{value2:2000},:is_a[175852345] {},Node[39840631]{name:"Year"}] | [Node[4932554]{value2:2000},:partOf[949624556] {},Node[5040387]{name:"2000-12-31"},:begins[692635107] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39543558]{name:"W91ZLK05P0312"},:isExecutedDuring[493804543] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39543558]{name:"W91ZLK05P0312"},:isAwardedTo[308465213] {},Node[28697949]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[4932554]{value2:2000},:is_a[175852345] {},Node[39840631]{name:"Year"}] | [Node[4932554]{value2:2000},:partOf[949624556] {},Node[5040387]{name:"2000-12-31"},:begins[692635107] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39543257]{name:"W91ZLK05M0058"},:isExecutedDuring[493804242] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39543257]{name:"W91ZLK05M0058"},:isAwardedTo[308464910] {},Node[28697949]{name:"MAK_TECHNOLOGIES_INC"}] |
| [Node[4932554]{value2:2000},:is_a[175852345] {},Node[39840631]{name:"Year"}] | [Node[4932554]{value2:2000},:partOf[949624556] {},Node[5040387]{name:"2000-12-31"},:begins[692635107] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39542220]{name:"W91ZLK04P1249"},:isExecutedDuring[493803205] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39542220]{name:"W91ZLK04P1249"},:isAwardedTo[308463856] {},Node[28697949]{name:"MAK_TECHNOLOGIES_INC"}] |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
203567 ms


 -- QUESTION: show all contracts for the amount range 1m - 10m executed in WASHINGTON_984241000

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name='Contract'),ttl=node:contractsNodesIndex(name='WASHINGTON_984241000') MATCH pvm=(x)-[:isExecutedIn]->(ttl), svm=(x)-[:hasContractValue]->(lvm) WHERE lvm.value1>1000000 AND lvm.value1<10000000 AND (x)-[:isExecutedIn]->(ttl) RETURN svm,pvm LIMIT 5;
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| svm                                                                                                      | pvm                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[15240752]{name:"DADA1302F0011"},:hasContractValue[1298935578] {},Node[3774590]{value1:1500000.0}]  | [Node[15240752]{name:"DADA1302F0011"},:isExecutedIn[502315649] {},Node[39598657]{name:"WASHINGTON_984241000"}] |
| [Node[15240752]{name:"DADA1302F0011"},:hasContractValue[1298935576] {},Node[10657998]{value1:6400000.0}] | [Node[15240752]{name:"DADA1302F0011"},:isExecutedIn[502315649] {},Node[39598657]{name:"WASHINGTON_984241000"}] |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
2 rows
1 ms
 
 -- QUESTION: contracts ending this fiscal year

 -- QUERY: neo4j-sh (0)$ START yr=node:contractsNodesIndex(name='Year') MATCH p=(x)-[:is_a]->(yr),q=(x)-[:partOf]->(l),r=(l)-[:ends]->(k),s=(t)-[:isExecutedDuring]->(k) WHERE x.value2=2013 RETURN p,q,r,s LIMIT 5;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                            | q                                                                                   | r                                                                                         | s                                                                                               |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[7535143]{value2:2013},:is_a[175895388] {},Node[39840631]{name:"Year"}] | [Node[7535143]{value2:2013},:partOf[949936999] {},Node[7542999]{name:"2013-12-31"}] | [Node[7542999]{name:"2013-12-31"},:ends[1235840775] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958777]{name:"ZZZZ"},:isExecutedDuring[494130505] {},Node[15430750]{name:"DATE_RANGE"}] |
| [Node[7535143]{value2:2013},:is_a[175895388] {},Node[39840631]{name:"Year"}] | [Node[7535143]{value2:2013},:partOf[949936999] {},Node[7542999]{name:"2013-12-31"}] | [Node[7542999]{name:"2013-12-31"},:ends[1235840775] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958775]{name:"ZZZ9"},:isExecutedDuring[494130504] {},Node[15430750]{name:"DATE_RANGE"}] |
| [Node[7535143]{value2:2013},:is_a[175895388] {},Node[39840631]{name:"Year"}] | [Node[7535143]{value2:2013},:partOf[949936999] {},Node[7542999]{name:"2013-12-31"}] | [Node[7542999]{name:"2013-12-31"},:ends[1235840775] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958774]{name:"ZZZ8"},:isExecutedDuring[494130503] {},Node[15430750]{name:"DATE_RANGE"}] |
| [Node[7535143]{value2:2013},:is_a[175895388] {},Node[39840631]{name:"Year"}] | [Node[7535143]{value2:2013},:partOf[949936999] {},Node[7542999]{name:"2013-12-31"}] | [Node[7542999]{name:"2013-12-31"},:ends[1235840775] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958773]{name:"ZZZ7"},:isExecutedDuring[494130502] {},Node[15430750]{name:"DATE_RANGE"}] |
| [Node[7535143]{value2:2013},:is_a[175895388] {},Node[39840631]{name:"Year"}] | [Node[7535143]{value2:2013},:partOf[949936999] {},Node[7542999]{name:"2013-12-31"}] | [Node[7542999]{name:"2013-12-31"},:ends[1235840775] {},Node[15430750]{name:"DATE_RANGE"}] | [Node[39958772]{name:"ZZZ6"},:isExecutedDuring[494130501] {},Node[15430750]{name:"DATE_RANGE"}] |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
1 ms

 -- QUESTION: contracts for janitorial services funded by GSA

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name='Contract'),pqr=node:contractsNodesIndex(name='GSA/PUBLIC_BUILDINGS_SERVICE'),rms=node:contractsNodesIndex(name='JANITORIAL_SERVICES') MATCH (x)-[:is_a]->(n), lvm=(x)-[:isFundedBy]->(pqr),pvm=(x)-[:hasDeliverables]->(rms) RETURN lvm,pvm LIMIT 5;
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| lvm                                                                                                                               | pvm                                                                                                                          |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[25746314]{name:"GX000199608DGS06P96GXC0143"},:isFundedBy[533274106] {},Node[19852615]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}] | [Node[25746314]{name:"GX000199608DGS06P96GXC0143"},:hasDeliverables[10431504] {},Node[27905090]{name:"JANITORIAL_SERVICES"}] |
| [Node[25032856]{name:"GSP0613TN5003"},:isFundedBy[532993280] {},Node[19852615]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}]              | [Node[25032856]{name:"GSP0613TN5003"},:hasDeliverables[9801011] {},Node[27905090]{name:"JANITORIAL_SERVICES"}]               |
| [Node[25032855]{name:"GSP0613TN5002"},:isFundedBy[532993279] {},Node[19852615]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}]              | [Node[25032855]{name:"GSP0613TN5002"},:hasDeliverables[9801010] {},Node[27905090]{name:"JANITORIAL_SERVICES"}]               |
| [Node[25032854]{name:"GSP0613TN5001"},:isFundedBy[532993278] {},Node[19852615]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}]              | [Node[25032854]{name:"GSP0613TN5001"},:hasDeliverables[9801009] {},Node[27905090]{name:"JANITORIAL_SERVICES"}]               |
| [Node[25032852]{name:"GSP0613TN0007"},:isFundedBy[532993276] {},Node[19852615]{name:"GSA/PUBLIC_BUILDINGS_SERVICE"}]              | [Node[25032852]{name:"GSP0613TN0007"},:hasDeliverables[9801007] {},Node[27905090]{name:"JANITORIAL_SERVICES"}]               |
+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
1264 ms
 
 -- QUESTION: how many contracts does IBM have currently in progress?

 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name='IBM') MATCH p=(t)-[:isAwardedTo]->(n) RETURN COUNT(p);
+----------+
| COUNT(p) |
+----------+
| 512      |
+----------+
1 row
0 ms
 
-- QUESTION: SHOW ME ALL THE CONTRACTS FUNDED BY BUREAU OF NEAR EASTERN AFFAIRS --
 
 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name = 'BUREAU_OF_NEAR_EASTERN_AFFAIRS') MATCH (x)-[:isFundedBy]->(n) RETURN x LIMIT 5;
+--------------------------------------------+
| x                                          |
+--------------------------------------------+
| Node[33628773]{name:"SYE700SANAAM1640"}    |
| Node[33628771]{name:"SYE700SANAAM0721"}    |
| Node[33628770]{name:"SYE700SANAAA10M2358"} |
| Node[33628768]{name:"SYE700SANAA1M1363"}   |
| Node[33628767]{name:"SYE700SANAA1M0786"}   |
+--------------------------------------------+
5 rows
0 ms
 
 -- QUESTION: What office is funding CONTRACT GS35F0119Y --
 
 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name = 'GS35F0119Y') MATCH (n)-[:isFundedBy]->(x) RETURN x LIMIT 5;
+-------------------------------------------------------------+
| x                                                           |
+-------------------------------------------------------------+
| Node[18084662]{name:"FAS_HEARTLAND_REGIONAL_ADMINISTRATOR"} |
+-------------------------------------------------------------+
1 row
0 ms
 
 -- QUESTION: How much is CONTRACT SPM5E113D5A07 --
 
 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name = 'SPM5E113D5A07') MATCH (n)-[:hasContractValue]->(x) RETURN x LIMIT 5;
+--------------------------------+
| x                              |
+--------------------------------+
| Node[3774588]{value1:150000.0} |
+--------------------------------+
1 row
0 ms
 
 -- QUESTION: SHOW ME CONTRACTS FUNDED BY DLA TROOP SUPPORT AND MANAGED BY DEPT OF DEFENSE --
 
 -- QUERY: neo4j-sh (0)$ START n=node:contractsNodesIndex(name = 'DLA_TROOP_SUPPORT'),m=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE') MATCH path=(n)<-[:isFundedBy]-(x)-[:isManagedBy]->(m) RETURN x, path LIMIT 5;
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| x                           | path                                                                                                                                                               |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[39958777]{name:"ZZZZ"} | [Node[16607638]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[538288124] {},Node[39958777]{name:"ZZZZ"},:isManagedBy[626248347] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958738]{name:"ZZ99"} | [Node[16607638]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[538288110] {},Node[39958738]{name:"ZZ99"},:isManagedBy[626248330] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958737]{name:"ZZ98"} | [Node[16607638]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[538288108] {},Node[39958737]{name:"ZZ98"},:isManagedBy[626248329] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958736]{name:"ZZ97"} | [Node[16607638]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[538288106] {},Node[39958736]{name:"ZZ97"},:isManagedBy[626248328] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
| Node[39958735]{name:"ZZ96"} | [Node[16607638]{name:"DLA_TROOP_SUPPORT"},:isFundedBy[538288105] {},Node[39958735]{name:"ZZ96"},:isManagedBy[626248327] {},Node[15560110]{name:"DEPT_OF_DEFENSE"}] |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
5 rows
1 ms

/////////////
 
 -- QUESTION: SHOW ME ALL THE BUSINESS EVENTS HANDLED BY GSA --
 
 -- QUERY: START n=node:contractsNodesIndex(name = 'BusinessEvent'),m=node:contractsNodesIndex({regex}) MATCH p=(n)-[*1..2]-(m) RETURN p", params);


START n=node:contractsNodesIndex(name = 'BusinessEvent'),m=node:contractsNodesIndex("name:GSA*") MATCH (t)-[:is_a]->(x)-[:is_a]->(n), (t)-[:isFundedBy]->(m) RETURN t;

START n=node:contractsNodesIndex(name = 'BusinessEvent'),m=node:contractsNodesIndex("name:GSA*") MATCH (x)-[:is_a]->(n), (t)-[:is_a]->(x) WHERE (t)-[:isFundedBy]->(m) RETURN t;
 
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| p                                                                                                                                                                                                              |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| [Node[10]{name:"BusinessEvent"},:is_a[5477] {alias:"is a"},Node[1099]{name:"GS06F0186Z"},:isFundedBy[7395] {alias:"isFundedBy"},Node[3446]{name:"GSA/ITS/GWAC CONTRACT OPERATIONS BRANCH C"}]                  |
| [Node[10]{name:"BusinessEvent"},:is_a[5473] {alias:"is a"},Node[1091]{name:"GS03P06CDA0038"},:isFundedBy[7391] {alias:"isFundedBy"},Node[3443]{name:"GSA/PBS/R03 REGIONALCONTRACTS SUPPORT SERVICES SECTION"}] |
| [Node[10]{name:"BusinessEvent"},:is_a[5467] {alias:"is a"},Node[1079]{name:"GS02P05PWC0018"},:isFundedBy[7385] {alias:"isFundedBy"},Node[3442]{name:"GSA/PUBLIC BUILDINGS SERVICE"}]                           |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
3 rows
608 ms
 
 -- QUESTION: SHOW ME ALL THE BUSINESS EVENTS FUNDED BY W0ML USA DEP TOBYHANNA AND MANAGED BY DEPT OF DEFENSE --
 
 -- QUERY: START n=node:node_auto_index(name = 'BusinessEvent'),m=node:node_auto_index(name = 'W0ML USA DEP TOBYHANNA'),l=node:node_auto_index(name = 'DEPT OF DEFENSE') MATCH p=n-[r]-x-[*1..2]-l WHERE m-[:isFundedBy]-x-[:isManagedBy]-l  RETURN x, p
 
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| x                                | p                                                                                                                                                                        |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Node[1866]{name:"W25G1V12A0279"} | [Node[10]{name:"BusinessEvent"},:is_a[5852] {alias:"is a"},Node[1866]{name:"W25G1V12A0279"},:isManagedBy[8729] {alias:"isManagedBy"},Node[3592]{name:"DEPT OF DEFENSE"}] |
+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row
599 ms
 
 -- QUESTION: SHOW ME ALL CONTRACTS THAT BEGIN ON DATE 1983-08-02 --
 
 -- QUERY: START n=node:contractsNodesIndex(name = 'Contract'),m=node:contractsNodesIndex(name = '1983-08-02'),p=node:contractsNodesIndex(name = 'Date') MATCH (m)-[:is_a]->(p),(m)-[:begins]->(plm),(x)-[:isExecutedDuring]->(plm) WHERE (x)-[:is_a]->(n) RETURN x;
+----------------------------------------+
| x                                      |
+----------------------------------------+
| Node[15487769]{name:"DEAC0483AL18796"} |
+----------------------------------------+
1 row
198491 ms
 
 -- QUESTION: SHOW ME DETAILS OF CONTRACT YF020199009C0488F1962888D0039 --
 
 -- QUERY: START n=node:contractsNodesIndex(name = 'YF020199009C0488F1962888D0039') MATCH path1=(n)-[r]->(x) RETURN path1;
+----------------------------------------------------------------------------------------------------------------------------------+
| path1                                                                                                                            |
+----------------------------------------------------------------------------------------------------------------------------------+
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasObligationValue[57883333] {},Node[9086401]{name:"36000"}]              |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasPart[177483233] {},Node[4623570]{name:"1990-09-15_"}]                  |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasPart[177483232] {},Node[38401927]{name:"VIRGINIA_"}]                   |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasPart[177483231] {},Node[17095563]{name:"ELECTRONIC_DATA_SYSTEMS"}]     |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:is_a[218055624] {},Node[14416769]{name:"Contract"}]                       |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isAwardedTo[320702727] {},Node[17095563]{name:"ELECTRONIC_DATA_SYSTEMS"}] |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isExecutedDuring[518241775] {},Node[4623570]{name:"1990-09-15_"}]         |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isExecutedIn[552358051] {},Node[38401927]{name:"VIRGINIA_"}]              |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isGivenTo[622263002] {},Node[17095563]{name:"ELECTRONIC_DATA_SYSTEMS"}]   |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isManagedBy[652585698] {},Node[15545121]{name:"DEPT_OF_THE_AIR_FORCE"}]   |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isPerformedDuring[733287387] {},Node[4623570]{name:"1990-09-15_"}]        |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:isPerformedIn[767403662] {},Node[38401927]{name:"VIRGINIA_"}]             |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasActionValue[1363412732] {},Node[9086401]{name:"36000"}]                |
| [Node[39827783]{name:"YF020199009C0488F1962888D0039"},:hasContractValue[1401324658] {},Node[18]{name:"0"}]                       |
+----------------------------------------------------------------------------------------------------------------------------------+
14 rows
3 ms
 
 -- QUESTION: SHOW ME ALL THE CONTRACTS THAT BEGIN IN 1983, ENDED IN YEAR 1993 AND ARE MANAGED BY DEPT OF DEFENSE --
 
 -- QUERY: START n=node:node_auto_index(name = 'Contract'),m=node:node_auto_index({regex1}),l=node:node_auto_index({regex2}),p=node:node_auto_index({regex3}) MATCH n-[:is_a]-x-[:ends]-l, p-[:isManagedBy]-x-[:begins]-m RETURN x

START n=node:contractsNodesIndex(name = 'Contract'),m=node:contractsNodesIndex(value2 = '1983'),p=node:contractsNodesIndex(value2 = '1993'),q=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE') MATCH (x)-[:isManagedBy]->(q),(x)-[:isExecutedDuring]->(pmn),(m)-[:begins]->(pmn),(p)-[:ends]->(pmn) WHERE (x)-[:is_a]->(n) RETURN x LIMIT 5;


START n=node:contractsNodesIndex(name = 'Contract'),m=node:contractsNodesIndex(value2 = '1983'),p=node:contractsNodesIndex(value2 = '1993'),t=node:contractsNodesIndex(name = 'Year'), q=node:contractsNodesIndex(name = 'DEPT_OF_DEFENSE') MATCH (x)-[:is_a]->(n), (x)-[:isManagedBy]->(q), (m)-[:is_a]->(t), (p)-[:is_a]->(t) RETURN x LIMIT 10;
 
+--------------------------------------------------+
| x                                                |
+--------------------------------------------------+
| Node[1565]{name:"N6523611D4801"}                 |
| Node[1309]{name:"HDEC0512D0006"}                 |
| Node[1380]{name:"HT001112A0010"}                 |
| Node[1382]{name:"HT001112A0068"}                 |
| Node[1395]{name:"HTC71112DW012"}                 |
| Node[1878]{name:"W52P1J12G0018"}                 |
| Node[1904]{name:"W911S011D0015"}                 |
| Node[1898]{name:"W911RX13D0001"}                 |
| Node[1924]{name:"W912HN10D0063"}                 |
| Node[1930]{name:"W912L613A0002"}                 |
| Node[1912]{name:"W9124D09D0011"}                 |
| Node[1948]{name:"W912P911D0501"}                 |
| Node[1970]{name:"ZD030199009C2041MDA90390D0035"} |
+--------------------------------------------------+
13 rows
722 ms
